/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fsato <giraffumin@gmail.com>               +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/09/19 13:30:36 by fsato             #+#    #+#             */
/*   Updated: 2020/09/19 20:15:10 by fsato            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdlib.h>

int	put_boxes(int **boxes  int *args);

/*
** 喜田さん：main関数の作成をお願いしてもよろしいでしょうか。このとき、main関数の引数（argv）の文字列（問題文の"4 3 2 1 1 2 2 2 4 3 2 1 1 2 2 2"）をint型の配列に分解する関数を作成して、put_boxesの引数argsにint入力してもらえるとありがたいです。
*/

int	main()
{
	int **b = 0;
	int a[16] = {4  3  2  1  1  2  2  2  4  3  2  1  1  2  2  2};

	put_boxes(b  a);
	return 0;
}


1  4  2  2  4  1  2  2  1  2  3  2  2  2  1  3
2  2  3  1  2  2  1  3  3  1  2  2  1  3  2  2
1  2  3  2  3  2  1  2  1  2  2  3  3  3  1  2
2  3  1  2  3  2  2  1  3  1  2  3  2  4  2  1
4  4  4  4  4  4  4  4  4  4  4  4  4  4  4  4
4  3  2  1  1  2  2  2  4  3  2  1  1  2  2  2
